ferrara-dev/kthedu/Y1/pic32_test/step1/startMenu_intro/input.c

/* input.c */

#include <pic32mx.h>
#include "peripherals.h"
#include "game.h"
#include "entity.h"
#include "interface.h"
#include "functions.h"

/* There needs to be a delay in the menus, otherwise it's hard to select buttons */
#define MENU_DELAY 1000000
void move(void);
void interface_menu_load_paused(void);
int getbtns_all(void);
/* The controls are as follows:
 *      SW3: Toggle inverted display
 * When in menu:
 *      BTN2: Press button
 *      BTN1: Up
 *      BTN3: Down
 * When in game:
 *      SW4: Pause
 *      BTN4: Left
 *      BTN3: Down
 *      BTN2: Up
 *      BTN1: Right
 */

enum INPUT
{
	BTN1 = 0x01,
	BTN2 = 0x02,
	BTN3 = 0x04,
	BTN4 = 0x08,
	SW1  = 0x10,
	SW2  = 0x20,
	SW3  = 0x40,
	SW4  = 0x80
};


/* As input_poll() will be called continously, data will need to be 
 * collected continously and then reset when acted upon
 */
static volatile int8_t data = 0;




void input_init(void)
{
	/* PORTD takes SW4-SW1 in bits <11:8> and BTN4-BTN2 in bits <7:5> */
	TRISDSET = 0x7f << 5;
	/* PORTF takes BTN1 in bit <1:1> */
	TRISFSET = 0x01 << 1;
}




/* Returns board input as a byte with the
 * input represented bitwise as
 * SW4 SW3 SW2 SW1 | BTN4 BTN3 BTN2 BTN1
 */
uint8_t input_poll(void)
{
	data |= (PORTD >> 4) & 0xFE; /* SW4-SW1, BTN4-BTN3 */
	data |= (PORTF >> 1) & 0x01; /* BTN1 */

	return data;
}

int getsw(void);
void input_update(void)
{
    /* State needs to be saved in case the player pauses whilst under */
    /* some kind of boost */
    static int prev_state;

    /* As data can be volatile, save it in a local variable for reading */
    int8_t const val = data;

    /* Set inversion flag */
    invert = val & SW3;

    /* Game instructions */
    if(state == STATE_MENU_TESTLED)
    {
        if(getsw() == 8)
        {
            prev_state = state;
            interface_menu_load_paused();
        }

        if(data & 0x1){

        }
    }
    /* Game instructions */
    if(state == STATE_MENU_TESTLED || state == STATE_PLAYING)
    {
        if(getsw() == 8)
        {
            prev_state = state;
            interface_menu_load_paused();
        }

        if(getbtns_all() == 8 || getbtns_all() == 1){
           move();
        }
    }


    /* Menu instructions */
	if(state & STATE_MENU)
	{
		quicksleep(MENU_DELAY);

		if(val & BTN3)
			interface_button_next();
		else if(val & BTN2)
			interface_button_press();
		else if(val & BTN1)
			interface_button_prev();
		if(state == STATE_MENU_PAUSED && ! (val & SW4))
			state = prev_state;


	}


	/* Reset data for next polling */
	data = 0;
}

int getsw(void){
    return (PORTD & (0xf << 8)) >> 8;
}

int getbtns_all(void){
    return ( ((PORTF>>1) & 0x1) | ((PORTD & (0x7 << 5)) >> 4));
}